public class Functions
{
    // Создайте функцию, выводящую по номеру месяца его название
    // 	Входные данные: 3
    // 	Ожидаемый результат: Март.
    // Найдите соответствие между символом Char и его кодировкой
    // Входные данные: A
    // Ожидаемый результат: 65
    // Переведите массив, состоящий из цифр и символов в символьный формат:
    // Входные данные: [‘hello’, 1811, ‘goodbye’’]
    // Ожидаемый результат: [‘hello’, ‘1811’, ‘goodbye’’]
    // 6.4 Переведите число в бинарный формат и сосчитайте кол-во единиц
    // Входные данные: 12
    // Ожидаемый результат 2 (От бинарного числа 1100)
    // 6.5 Уберите все символьные значения из массива, созданного из чисел и строк
    // Входные данные: [881, ‘laugh’, 16, ‘b’, ‘k’, ‘programming’]
    // Выходные данные: [881, 16]
}